# Overview of Genres:

In [3]:
import requests
import json
import pandas as pd

In [4]:
df = pd.read_csv ("imdb_movies.csv")
df.head()

,names,date_x,score,genre,overview,crew,orig_title,status,orig_lang,budget_x,revenue,country
0,Creed III,03/02/2023,73.0,"Drama, Action","After dominating the boxing world, Adonis Cree...","Michael B. Jordan, Adonis Creed, Tessa Thompso...",Creed III,Released,English,75000000.0,2.716167e+08,AU
1,Avatar: The Way of Water,12/15/2022,78.0,"Science Fiction, Adventure, Action",Set more than a decade after the events of the...,"Sam Worthington, Jake Sully, Zoe Saldaña, Neyt...",Avatar: The Way of Water,Released,English,460000000.0,2.316795e+09,AU
2,The Super Mario Bros. Movie,04/05/2023,76.0,"Animation, Adventure, Family, Fantasy, Comedy","While working underground to fix a water main,...","Chris Pratt, Mario (voice), Anya Taylor-Joy, P...",The Super Mario Bros. Movie,Released,English,100000000.0,7.244590e+08,AU
3,Mummies,01/05/2023,70.0,"Animation, Comedy, Family, Adventure, Fantasy","Through a series of unfortunate events, three ...","Óscar Barberán, Thut (voice), Ana Esther Albor...",Momias,Released,"Spanish, Castilian",12300000.0,3.420000e+07,AU
4,Supercell,03/17/2023,61.0,Action,Good-hearted teenager William always lived in ...,"Skeet Ulrich, Roy Cameron, Anne Heche, Dr Quin...",Supercell,Released,English,77000000.0,3.409420e+08,US

In [5]:
movie_df = df[["names","date_x","score","genre","budget_x","revenue","orig_lang"]].copy()
movie_df.head()

,names,date_x,score,genre,budget_x,revenue,orig_lang
0,Creed III,03/02/2023,73.0,"Drama, Action",75000000.0,2.716167e+08,English
1,Avatar: The Way of Water,12/15/2022,78.0,"Science Fiction, Adventure, Action",460000000.0,2.316795e+09,English
2,The Super Mario Bros. Movie,04/05/2023,76.0,"Animation, Adventure, Family, Fantasy, Comedy",100000000.0,7.244590e+08,English
3,Mummies,01/05/2023,70.0,"Animation, Comedy, Family, Adventure, Fantasy",12300000.0,3.420000e+07,"Spanish, Castilian"
4,Supercell,03/17/2023,61.0,Action,77000000.0,3.409420e+08,English

In [6]:
# movie_df["orig_lang"] = movie_df["orig_lang"].str.lstrip().str.rstrip()
movie_df["orig_lang"] = movie_df["orig_lang"].str.strip()
filtered_movies_df = movie_df[(movie_df["revenue"] > 0) & (movie_df["orig_lang"] == "English")]
filtered_movies_df.head(5)

,names,date_x,score,genre,budget_x,revenue,orig_lang
0,Creed III,03/02/2023,73.0,"Drama, Action",75000000.0,2.716167e+08,English
1,Avatar: The Way of Water,12/15/2022,78.0,"Science Fiction, Adventure, Action",460000000.0,2.316795e+09,English
2,The Super Mario Bros. Movie,04/05/2023,76.0,"Animation, Adventure, Family, Fantasy, Comedy",100000000.0,7.244590e+08,English
4,Supercell,03/17/2023,61.0,Action,77000000.0,3.409420e+08,English
5,Cocaine Bear,02/23/2023,66.0,"Thriller, Comedy, Crime",35000000.0,8.000000e+07,English

In [7]:
filtered_movies_df["names"].unique()

array(['Creed III', 'Avatar: The Way of Water',
       'The Super Mario Bros. Movie', ..., 'The Russia House',
       'Darkman II: The Return of Durant',
       'The Swan Princess: A Royal Wedding'], dtype=object)

In [8]:
filtered_movies_df.dtypes

names         object
date_x        object
score        float64
genre         object
budget_x     float64
revenue      float64
orig_lang     object
dtype: object

In [9]:
# Convert 'Year' column to datetime format
filtered_movies_df.loc[:,"date_x"]=pd.to_datetime(filtered_movies_df["date_x"], errors='coerce').dt.year.astype(int)
filtered_movies_df = filtered_movies_df.rename(columns={"date_x":"Year",
                                                        "budget_x":"Budget",
                                                        "names":"Name",
                                                        "score":"Score",
                                                        "genre":"Genre",
                                                        "revenue":"Revenue",
                                                        "orig_lang":"Language"
                                                       })
filtered_movies_df.head()

,Name,Year,Score,Genre,Budget,Revenue,Language
0,Creed III,2023,73.0,"Drama, Action",75000000.0,2.716167e+08,English
1,Avatar: The Way of Water,2022,78.0,"Science Fiction, Adventure, Action",460000000.0,2.316795e+09,English
2,The Super Mario Bros. Movie,2023,76.0,"Animation, Adventure, Family, Fantasy, Comedy",100000000.0,7.244590e+08,English
4,Supercell,2023,61.0,Action,77000000.0,3.409420e+08,English
5,Cocaine Bear,2023,66.0,"Thriller, Comedy, Crime",35000000.0,8.000000e+07,English

In [10]:
filtered_movies_df.dtypes

Name         object
Year         object
Score       float64
Genre        object
Budget      float64
Revenue     float64
Language     object
dtype: object

In [11]:
# Convert 'Year' column to numeric format
filtered_movies_df['Year'] = pd.to_numeric(filtered_movies_df['Year'], errors='coerce')

# Check for non-numeric values
non_numeric_years = filtered_movies_df[filtered_movies_df['Year'].isnull()]
print(f"Non-numeric values are: {non_numeric_years}")

# Check unique values in 'Year' column
filtered_movies_df = filtered_movies_df.loc[(filtered_movies_df["Year"]<=2020)&(filtered_movies_df["Year"]>=1990),:]
Unique_years = filtered_movies_df['Year'].unique()
Unique_years

Non-numeric values are: Empty DataFrame
Columns: [Name, Year, Score, Genre, Budget, Revenue, Language]
Index: []

array([2004, 2017, 2019, 1994, 2009, 2014, 1993, 2018, 2015, 2016, 2020,
       2005, 2001, 2002, 2012, 2010, 2007, 2011, 2003, 1995, 1997, 2006,
       1990, 2013, 1998, 2008, 2000, 1999, 1992, 1991, 1996], dtype=int64)

In [12]:
# Check how many data points we have:
filtered_movies_df.count()

Name        5272
Year        5272
Score       5272
Genre       5266
Budget      5272
Revenue     5272
Language    5272
dtype: int64

In [13]:
# Check if there are all unique:
filtered_movies_df.nunique()

Name        5093
Year          31
Score         61
Genre       1530
Budget      1159
Revenue     4968
Language       1
dtype: int64

In [14]:
# Check for any duplication:
duplicated_movies = filtered_movies_df[filtered_movies_df.duplicated(["Name","Year"],keep="first")]
print(f"The following movies were duplicated: ")
print (duplicated_movies)

The following movies were duplicated:
                    Name  Year  Score                               Genre  \
212         The Avengers  2012   77.0  Science Fiction, Action, Adventure
222             Brothers  2010   73.0                Drama, Thriller, War
328        The Lion King  1994   83.0            Family, Animation, Drama
380               Scream  1997   74.0              Crime, Horror, Mystery
418                Mulan  1998   79.0        Animation, Family, Adventure
...                  ...   ...    ...                                 ...
7723          The Signal  2014   60.0           Thriller, Science Fiction
8115        Little Women  1994   73.0                      Drama, Romance
8219  Death at a Funeral  2010   58.0                              Comedy
8991                Skin  2018   66.0                               Drama
9149     The Jungle Book  1994   60.0            Family, Adventure, Drama

          Budget      Revenue Language
212   60000000.0   48585416.0  English
222   13000000.0   17856688.0  English
328   79300000.0  986193783.0  English
380   15000000.0  173046640.0  English
418   90000000.0  303500000.0  English
...          ...          ...      ...
7723     50000.0     406299.0  English
8115  15000000.0   50003303.0  English
8219  20000000.0   47289148.0  English
8991  47220616.4  319773152.6  English
9149  27000000.0   44342956.0  English

[106 rows x 7 columns]

In [15]:
# Check for leading or trailing white spaces and standardize capitalization:
filtered_movies_df['Name'] = filtered_movies_df['Name'].str.strip()
filtered_movies_df['Name'] = filtered_movies_df['Name'].str.lower()
# Dropping the duplications:
deduplicated_movies_df = filtered_movies_df.drop_duplicates(subset=["Name","Year"],keep=False)
deduplicated_movies_df.reset_index(drop=True, inplace = True)
deduplicated_movies_df.count()

Name        5063
Year        5063
Score       5063
Genre       5058
Budget      5063
Revenue     5063
Language    5063
dtype: int64

In [16]:
deduplicated_movies_df.loc[:, ['Score', 'Budget', 'Revenue']] = deduplicated_movies_df[['Score', 'Budget', 'Revenue']].apply(pd.to_numeric, errors="coerce")
Stripped_df = deduplicated_movies_df.dropna()
Stripped_df.count()

Name        5058
Year        5058
Score       5058
Genre       5058
Budget      5058
Revenue     5058
Language    5058
dtype: int64

In [17]:
Stripped_df.count()

Name        5058
Year        5058
Score       5058
Genre       5058
Budget      5058
Revenue     5058
Language    5058
dtype: int64

In [18]:
Stripped_df.dtypes

Name         object
Year          int64
Score       float64
Genre        object
Budget      float64
Revenue     float64
Language     object
dtype: object

In [19]:
Stripped_df["Genre"].unique()

array(['Drama', 'Action,\xa0Thriller,\xa0Crime', 'Drama,\xa0Crime', ...,
       'Adventure,\xa0Comedy,\xa0Family,\xa0Science Fiction,\xa0Action',
       'Drama,\xa0Science Fiction,\xa0Romance',
       'Action,\xa0Adventure,\xa0Science Fiction,\xa0Thriller,\xa0Horror'],
      dtype=object)

In [20]:
for index, row in Stripped_df.iterrows():
    Stripped_df.loc[index, 'Genre'] = ', '.join(row['Genre'].replace('\xa0', '').split(','))
Stripped_df['Genre']

0                                                   Drama
1                                 Action, Thriller, Crime
2                                 Action, Thriller, Crime
3                                            Drama, Crime
4             Action, Adventure, Fantasy, Science Fiction
                              ...
5058                                                Drama
5059                                               Action
5060                             Drama, Thriller, Romance
5061    Action, Adventure, Science Fiction, Thriller, ...
5062                           Animation, Family, Fantasy
Name: Genre, Length: 5058, dtype: object

In [21]:
# Create a deep copy of the DataFrame
Stripped_df = Stripped_df.copy()

# Iterate through each row in the DataFrame
for index, row in Stripped_df.iterrows():
    # Calculate profit for the current movie
    profit = row['Revenue'] - row['Budget']
    # Assign the calculated profit to the 'Profit' column for the current row
    Stripped_df.loc[index, 'Profit'] = profit

Stripped_df.head()

,Name,Year,Score,Genre,Budget,Revenue,Language,Profit
0,the passion of the christ,2004,74.0,Drama,25000000.0,6.223136e+08,English,5.973136e+08
1,john wick: chapter 2,2017,73.0,"Action, Thriller, Crime",40000000.0,1.715399e+08,English,1.315399e+08
2,john wick: chapter 3 - parabellum,2019,74.0,"Action, Thriller, Crime",55000000.0,3.267097e+08,English,2.717097e+08
3,a bronx tale,1994,78.0,"Drama, Crime",10000000.0,1.728790e+07,English,7.287898e+06
4,avatar,2009,76.0,"Action, Adventure, Fantasy, Science Fiction",237000000.0,2.923706e+09,English,2.686706e+09

In [22]:
# # Initialize an empty set to store all unique genres
# unique_genres = set()

# # Iterate over the DataFrame rows
# for index, row in Stripped_df.iterrows():
#     # Split the 'Genre' column by commas and add each genre to the set
#     movie_genres = [genre.strip() for genre in row['Genre'].split(',')]
#     unique_genres.update(movie_genres)

# # Convert the set of unique genres to a list
# unique_genres = list(unique_genres)

# # Iterate over the DataFrame rows again to create genre columns
# for index, row in Stripped_df.iterrows():
#     # Split the 'Genre' column by commas and create a dictionary to store genre values
#     movie_genres = {genre: 1 if genre.strip() in row['Genre'] else 0 for genre in unique_genres}
    
#     # Update the DataFrame row with genre values
#     for genre, value in movie_genres.items():
#         Stripped_df.at[index, genre] = value

# # Print the updated DataFrame
# Stripped_df.head(15)

In [23]:
# Export the wrangled_df into a csv
wrangled_df = Stripped_df.to_csv("wrangled_df.csv",index_label="Movie ID")